import { SceneContext } from 'telegraf/typings/scenes';

interface IOnUseActionArgs {
  ctx: SceneContext;
}

export const botStoppingHelper = async (args: IOnUseActionArgs) => {
  const { ctx } = args;
  const text = `
🛠️ <b>Технические работы</b>

В настоящее время бот находится на техническом обслуживании. 
Мы работаем над улучшением функциональности и стабильности.

Приносим извинения за временные неудобства. 
Попробуйте позже или воспользуйтесь ботом через некоторое время.

Спасибо за понимание! ❤️`;

  await ctx.reply(text, { parse_mode: 'HTML' });
};
